Revit 2024 API
ICentralLockedCallback Interface
 An interface that may be used to control Revit's behavior when it tries to lock central and is blocked because another user already has locked central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public interface ICentralLockedCallback
Visual Basic
Public Interface ICentralLockedCallback
Visual C++
public interface class ICentralLockedCallback
See Also
ICentralLockedCallback Members
Autodesk.Revit.DB Namespace